tap "mhaeuser/mhaeuser"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Simple terminal UI for git commands
brew "lazygit"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Terminal multiplexer
brew "tmux"
# Control the platform power state of your Apple Silicon device
cask "battery-toolkit"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Game development engine
cask "godot"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Control your tools with a few keystrokes
cask "raycast"
# System monitor for the menu bar
cask "stats"
# Messaging app with a focus on speed and security
cask "telegram"
# Google Chromium, sans integration with Google
cask "ungoogled-chromium"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Web browser
cask "yandex"
# Multiplayer code editor
cask "zed"
vscode "alefragnani.project-manager"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-extension-pack"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "kevinrose.vsc-python-indent"
vscode "linhmtran168.mac-ca-vscode"
vscode "luggage66.awk"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-hub"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.tensorboard"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "njpwerner.autodocstring"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vivaxy.vscode-conventional-commits"
vscode "webhooked.kanso-theme"
vscode "wholroyd.jinja"
